yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/main.cpp
    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);

    /* Face detection: input 192x192 grayscale */
    TfLiteIntArray *inputShape_FD = faceDetectionModel.GetInputShape(0);
    const int inputImgCols_FD = inputShape_FD->data[arm::app::FaceDetectionModel::ms_inputColsIdx];
    const int inputImgRows_FD = inputShape_FD->data[arm::app::FaceDetectionModel::ms_inputRowsIdx];
    TfLiteTensor *outputTensor0_FD = faceDetectionModel.GetOutputTensor(0);
    TfLiteTensor *outputTensor1_FD = faceDetectionModel.GetOutputTensor(1);
    const arm::app::face_detection::PostProcessParams postProcessParams_FD{
        inputImgRows_FD,
        inputImgCols_FD,
        GLCD_HEIGHT,
        GLCD_WIDTH,
        anchor1,
        anchor2,
        FACE_PRESENCE_THRESHOLD,
        0.45f,
        1,  /* numClasses */
        0   /* topN */
    };
    arm::app::FaceDetectorPostProcess postProcess_FD(outputTensor0_FD, outputTensor1_FD,
        s_asFramebuf[0].results_FD, postProcessParams_FD);

    /* Mouth PP anchor grids must match trained input size (e.g. 128 vs 192) */
    arm::app::mouth_detection::MouthYOLOv8PostProcessing postProcess(&model,
        MOUTH_DETECTION_THRESHOLD,
        MOUTH_NMS_THRESHOLD,
        inputImgRows);
	
    //display framebuffer
    image_t frameBuffer;
    rectangle_t roi;

    //omv library init
    omv_init();
    framebuffer_init_image(&frameBuffer);

#if defined(__PROFILE__)

    arm::app::Profiler profiler;
    uint64_t u64StartCycle;
    uint64_t u64EndCycle;
    uint64_t u64CCAPStartCycle;
    uint64_t u64CCAPEndCycle;
#else
    pmu_reset_counters();
#endif

#define EACH_PERF_SEC 5
    uint64_t u64PerfCycle;
    uint64_t u64PerfFrames = 0;

    u64PerfCycle = pmu_get_systick_Count();
    u64PerfCycle += (SystemCoreClock * EACH_PERF_SEC);

    S_FRAMEBUF *infFramebuf;
    S_FRAMEBUF *fullFramebuf;
    S_FRAMEBUF *emptyFramebuf;

    //Setup image senosr
    ImageSensor_Init();
    ImageSensor_Config(eIMAGE_FMT_RGB565, frameBuffer.w, frameBuffer.h, true);

#if defined (__USE_DISPLAY__)
    char szDisplayText[100];
    S_DISP_RECT sDispRect;

    Display_Init();
    Display_ClearLCD(C_WHITE);
#endif

#if defined (__USE_UVC__)
	UVC_Init();
    HSUSBD_Start();
#endif

    while (1)
    {
        emptyFramebuf = get_empty_framebuf();

        if (emptyFramebuf)
        {
            //capture frame from CCAP
#if defined(__PROFILE__)
            u64CCAPStartCycle = pmu_get_systick_Count();
#endif

            ImageSensor_TriggerCapture((uint32_t)(emptyFramebuf->frameImage.data));
		}
		
        fullFramebuf = get_full_framebuf();

        if (fullFramebuf)
        {
            fullFramebuf->results_FD.clear();
            fullFramebuf->results.clear();

            /* --- Step 1: Face detection on full frame (192x192 grayscale) --- */
            TfLiteTensor *inputTensor_FD = faceDetectionModel.GetInputTensor(0);
            roi.x = 0;
            roi.y = 0;
            roi.w = fullFramebuf->frameImage.w;
            roi.h = fullFramebuf->frameImage.h;
            image_t resizeImg_FD;
            resizeImg_FD.w = inputImgCols_FD;
            resizeImg_FD.h = inputImgRows_FD;
            resizeImg_FD.data = (uint8_t *)inputTensor_FD->data.data;
            resizeImg_FD.pixfmt = PIXFORMAT_GRAYSCALE;
            imlib_nvt_scale(&fullFramebuf->frameImage, &resizeImg_FD, &roi);

            auto *req_FD = static_cast<uint8_t *>(inputTensor_FD->data.data);
            auto *signed_FD = static_cast<int8_t *>(inputTensor_FD->data.data);
            for (size_t i = 0; i < inputTensor_FD->bytes; i++)
            {
                int32_t v = static_cast<int32_t>(req_FD[i]) - 128;
                signed_FD[i] = static_cast<int8_t>(v);
            }
            faceDetectionModel.RunInference();
            postProcess_FD.RunPostProcess(fullFramebuf->results_FD);

            /* Expand face boxes 1.4x (like FaceLandmark) */
            float scaleFactorH = 1.4f;
            for (size_t i = 0; i < fullFramebuf->results_FD.size(); i++)
            {
                auto *fb = &fullFramebuf->results_FD[i];
                float scaleW = scaleFactorH * fb->m_h;
                float scaleH = scaleFactorH * fb->m_h;
                int newX = fb->m_x0 - (int)((scaleW - fb->m_w) / 2);
                int newY = fb->m_y0 - (int)((scaleH - fb->m_h) / 2);
                if (newX < 0) newX = 0;
                if (newY < 0) newY = 0;
                int newW = (int)scaleW;
                int newH = (int)scaleH;
                if (newX + newW >= (int)fullFramebuf->frameImage.w)
                    newW = fullFramebuf->frameImage.w - newX;
                if (newY + newH >= (int)fullFramebuf->frameImage.h)
                    newH = fullFramebuf->frameImage.h - newY;
                fb->m_x0 = newX;
                fb->m_y0 = newY;
                fb->m_w = newW;
                fb->m_h = newH;
            }

            /* --- Step 2: For each face, crop and run mouth model --- */
            static std::vector<arm::app::face_detection::DetectionResult> s_mouthTemp;
            for (size_t f = 0; f < fullFramebuf->results_FD.size(); f++)
            {
                const auto &faceBox = fullFramebuf->results_FD[f];
                roi.x = faceBox.m_x0;
                roi.y = faceBox.m_y0;
                roi.w = faceBox.m_w;
                roi.h = faceBox.m_h;

                image_t resizeImg;
                resizeImg.w = inputImgCols;
                resizeImg.h = inputImgRows;
                resizeImg.data = (uint8_t *)inputTensor->data.data;
                resizeImg.pixfmt = PIXFORMAT_RGB888;
                imlib_nvt_scale(&fullFramebuf->frameImage, &resizeImg, &roi);

                auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
                auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

                /* One-time diagnostic: dump first few RGB pixels before quantisation */
                {
                    static bool s_dumpedOnce = false;
                    if (!s_dumpedOnce) {
                        s_dumpedOnce = true;
                        int diagPx;
                        info("DIAG face crop roi=(%d,%d %dx%d) -> mouth input %dx%d\n",
                             roi.x, roi.y, roi.w, roi.h, inputImgCols, inputImgRows);
                        info("DIAG first 12 RGB pixels (uint8, before quant):\n");
                        for (diagPx = 0; diagPx < 12; diagPx++) {
                            info("  px%d: R=%u G=%u B=%u\n", diagPx,
                                 req_data[diagPx*3+0], req_data[diagPx*3+1], req_data[diagPx*3+2]);
                        }
                        int cIdx = ((inputImgRows/2)*inputImgCols + inputImgCols/2) * 3;
                        info("DIAG center pixel: R=%u G=%u B=%u\n",
                             req_data[cIdx], req_data[cIdx+1], req_data[cIdx+2]);
                    }
                }

                for (size_t i = 0; i < inputTensor->bytes; i++)
                {
                    int32_t v = static_cast<int32_t>(req_data[i]) - 128;
                    signed_req_data[i] = static_cast<int8_t>(v);
                }
                model.RunInference();

                /* One-time diagnostic: dump output tensor shapes + first few values */
                {
                    static bool s_dumpedOut = false;
                    if (!s_dumpedOut) {
                        s_dumpedOut = true;
                        int diagT, diagK;
                        for (diagT = 0; diagT < 6; diagT++) {
                            TfLiteTensor *ot = model.GetOutputTensor(diagT);
                            float otScale = ((TfLiteAffineQuantization*)(ot->quantization.params))->scale->data[0];
                            int otZp = ((TfLiteAffineQuantization*)(ot->quantization.params))->zero_point->data[0];
                            info("DIAG out[%d] shape=[%d,%d,%d] scale=%.6f zp=%d\n",
                                 diagT, ot->dims->data[0], ot->dims->data[1], ot->dims->data[2],
                                 otScale, otZp);
                            int8_t *d = ot->data.int8;
                            int diagMax = 8;
                            if (diagMax > (int)ot->bytes) diagMax = (int)ot->bytes;
                            for (diagK = 0; diagK < diagMax; diagK++) {
                                info("  [%d]=%d", diagK, (int)d[diagK]);
                            }
                            info("\n");
                        }
                    }
                }

